IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_gpio_ctrl_regs.xml
	<register id="GPAINV" width="32" page="1" offset="0x10" internal="0" description="GPIO A Input Polarity Invert Registers (GPIO0 to 31)">
		<bitfield id="GPIO0" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPAODR" width="32" page="1" offset="0x12" internal="0" description="GPIO A Open Drain Output Register (GPIO0 to GPIO31)">
		<bitfield id="GPIO0" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Outpout Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Outpout Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Outpout Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Outpout Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Outpout Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Outpout Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Outpout Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="Outpout Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Outpout Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Outpout Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Outpout Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Outpout Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Outpout Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Outpout Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Outpout Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Outpout Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Outpout Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Outpout Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Outpout Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Outpout Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Outpout Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Outpout Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPAAMSEL" width="32" page="1" offset="0x14" internal="0" description="GPIO A Analog Mode Select register (GPIO0 to GPIO31)">
		<bitfield id="GPIO12" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Analog Mode select for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="GPAGMUX1" width="32" page="1" offset="0x20" internal="0" description="GPIO A Peripheral Group Mux (GPIO0 to 15)">
		<bitfield id="GPIO0" description="Defines pin-muxing selection for GPIO0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO1" description="Defines pin-muxing selection for GPIO1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO2" description="Defines pin-muxing selection for GPIO2" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO3" description="Defines pin-muxing selection for GPIO3" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO4" description="Defines pin-muxing selection for GPIO4" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO5" description="Defines pin-muxing selection for GPIO5" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO6" description="Defines pin-muxing selection for GPIO6" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO7" description="Defines pin-muxing selection for GPIO7" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO8" description="Defines pin-muxing selection for GPIO8" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO9" description="Defines pin-muxing selection for GPIO9" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO10" description="Defines pin-muxing selection for GPIO10" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO11" description="Defines pin-muxing selection for GPIO11" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO12" description="Defines pin-muxing selection for GPIO12" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO13" description="Defines pin-muxing selection for GPIO13" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO14" description="Defines pin-muxing selection for GPIO14" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO15" description="Defines pin-muxing selection for GPIO15" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPAGMUX2" width="32" page="1" offset="0x22" internal="0" description="GPIO A Peripheral Group Mux (GPIO16 to 31)">
		<bitfield id="GPIO16" description="Defines pin-muxing selection for GPIO16" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO17" description="Defines pin-muxing selection for GPIO17" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO18" description="Defines pin-muxing selection for GPIO18" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO19" description="Defines pin-muxing selection for GPIO19" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO20" description="Defines pin-muxing selection for GPIO20" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO21" description="Defines pin-muxing selection for GPIO21" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO22" description="Defines pin-muxing selection for GPIO22" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Defines pin-muxing selection for GPIO23" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO24" description="Defines pin-muxing selection for GPIO24" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Defines pin-muxing selection for GPIO25" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO26" description="Defines pin-muxing selection for GPIO26" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO27" description="Defines pin-muxing selection for GPIO27" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO28" description="Defines pin-muxing selection for GPIO28" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO29" description="Defines pin-muxing selection for GPIO29" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO30" description="Defines pin-muxing selection for GPIO30" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Defines pin-muxing selection for GPIO31" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
