IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_gpio_ctrl_regs.xml
	<register id="GPHPUD" width="32" page="1" offset="0x1cc" internal="0" description="GPIO H Pull Up Disable Register (GPIO224 to 255) ">
		<bitfield id="GPIO224" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHINV" width="32" page="1" offset="0x1d0" internal="0" description="GPIO H Input Polarity Invert Registers (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHODR" width="32" page="1" offset="0x1d2" internal="0" description="GPIO H Open Drain Output Register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Outpout Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHAMSEL" width="32" page="1" offset="0x1d4" internal="0" description="GPIO H Analog Mode Select register (GPIO224 to GPIO255)">
		<bitfield id="GPIO224" description="Analog Mode select for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Analog Mode select for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Analog Mode select for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Analog Mode select for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Analog Mode select for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO244" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO245" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHGMUX1" width="32" page="1" offset="0x1e0" internal="0" description="GPIO H Peripheral Group Mux (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Defines pin-muxing selection for GPIO224" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines pin-muxing selection for GPIO226" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines pin-muxing selection for GPIO227" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines pin-muxing selection for GPIO228" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines pin-muxing selection for GPIO230" begin="13" end="12" width="2" rwaccess="RW"/>
	</register>
